In [98]:
import numpy as np
import pandas as pd

In [99]:
# Dataframe 1: Employee information
employees = pd.DataFrame({
    'EmployeeID': [1, 2, 3, 4,5],
    'Name': ['Rajesh', 'Suresh', 'Ravi', 'Raghav', 'Amit'],
    'Department': ['HR', 'Finance', 'IT', 'Marketing',  'Editing'],
    
})
#Dataframe 2 : Salary information
salaries = pd.DataFrame({
    'EmployeeID': [1, 2, 3,6,7 ],
    'Salary': [50000, 60000, 70000 , 80000, 90000],
    'Bonus' : [5000, 6000, 7000, 8000, 9000]
})

In [100]:
employees

   EmployeeID    Name Department
0           1  Rajesh         HR
1           2  Suresh    Finance
2           3    Ravi         IT
3           4  Raghav  Marketing
4           5    Amit    Editing

In [101]:
salaries

   EmployeeID  Salary  Bonus
0           1   50000   5000
1           2   60000   6000
2           3   70000   7000
3           6   80000   8000
4           7   90000   9000

In [102]:
pd.merge(employees,salaries)

   EmployeeID    Name Department  Salary  Bonus
0           1  Rajesh         HR   50000   5000
1           2  Suresh    Finance   60000   6000
2           3    Ravi         IT   70000   7000

In [103]:
pd.merge(employees,salaries,on ='EmployeeID', how='inner')

   EmployeeID    Name Department  Salary  Bonus
0           1  Rajesh         HR   50000   5000
1           2  Suresh    Finance   60000   6000
2           3    Ravi         IT   70000   7000

In [104]:
pd.merge(employees,salaries,on ='EmployeeID', how='outer')

   EmployeeID    Name Department   Salary   Bonus
0           1  Rajesh         HR  50000.0  5000.0
1           2  Suresh    Finance  60000.0  6000.0
2           3    Ravi         IT  70000.0  7000.0
3           4  Raghav  Marketing      NaN     NaN
4           5    Amit    Editing      NaN     NaN
5           6     NaN        NaN  80000.0  8000.0
6           7     NaN        NaN  90000.0  9000.0

In [105]:
pd.merge(employees,salaries,on ='EmployeeID', how='left')

   EmployeeID    Name Department   Salary   Bonus
0           1  Rajesh         HR  50000.0  5000.0
1           2  Suresh    Finance  60000.0  6000.0
2           3    Ravi         IT  70000.0  7000.0
3           4  Raghav  Marketing      NaN     NaN
4           5    Amit    Editing      NaN     NaN

In [106]:
pd.merge(employees,salaries,on ='EmployeeID', how='right')

   EmployeeID    Name Department  Salary  Bonus
0           1  Rajesh         HR   50000   5000
1           2  Suresh    Finance   60000   6000
2           3    Ravi         IT   70000   7000
3           6     NaN        NaN   80000   8000
4           7     NaN        NaN   90000   9000

# Concatenation of 2 dataframes

In [107]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3']
    
})

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B':['B4', 'B5', 'B6', 'B7'],
    'C':['C4', 'C5', 'C6', 'C7']
})

In [108]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [109]:
df2

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [110]:
pd.concat([df1, df2], ignore_index=True)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [111]:
pd.concat([df1,df2], axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

# Joining two dataframes

In [112]:
#first dataframe
df1 = pd.DataFrame({
    'Name':['Rajesh', 'Suresh', 'Ravi', 'Raghav', 'Amit'],
},index=[0,1,2,3,4])

#second dataframe
df2 = pd.DataFrame({
    'score':[90, 80, 70, 60, 50],
},index=[2,3,4,5,6])

In [113]:
df1

     Name
0  Rajesh
1  Suresh
2    Ravi
3  Raghav
4    Amit

In [114]:
df2

   score
2     90
3     80
4     70
5     60
6     50

In [115]:
df1.join(df2)

     Name  score
0  Rajesh    NaN
1  Suresh    NaN
2    Ravi   90.0
3  Raghav   80.0
4    Amit   70.0

In [116]:
df1.join(df2,how='outer')

     Name  score
0  Rajesh    NaN
1  Suresh    NaN
2    Ravi   90.0
3  Raghav   80.0
4    Amit   70.0
5     NaN   60.0
6     NaN   50.0

In [117]:
df2.join(df1)

   score    Name
2     90    Ravi
3     80  Raghav
4     70    Amit
5     60     NaN
6     50     NaN